nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/spi_flash_2xx.h
/**
  ******************************************************************************
  * @file    spi_flash.h
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    18-April-2011
  * @brief   This file contains all the functions prototypes for the spi_flash
  *          firmware driver.
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************  
  */ 

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __SPI_FLASH_H
#define __SPI_FLASH_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include "stm32f10x_rcc.h"

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/

/* M25P SPI Flash supported commands */  
#define sFLASH_CMD_WRITE          0x02  /* Write to Memory instruction */
#define sFLASH_CMD_WRSR           0x01  /* Write Status Register instruction */
#define sFLASH_CMD_WREN           0x06  /* Write enable instruction */
#define sFLASH_CMD_READ           0x03  /* Read from Memory instruction */
#define sFLASH_CMD_RDSR           0x05  /* Read Status Register instruction  */
#define sFLASH_CMD_RDID           0x9F  /* Read identification */
#define sFLASH_CMD_SE             0x20  /* Sector Erase instruction */
#define sFLASH_CMD_BE             0xC7  /* Bulk Erase instruction */

#define sFLASH_WIP_FLAG           0x01  /* Write In Progress (WIP) flag */

#define sFLASH_DUMMY_BYTE         0xA5
#define sFLASH_SPI_PAGESIZE       0x100

#define sFLASH_M25P128_ID         0x202018
#define sFLASH_M25P64_ID          0x202017
#define sFLASH_AT26DF161_ID       0x1F4700
   
/* M25P FLASH SPI 引脚接口  */  
#define sFLASH_SPI                          SPI1
#define sFLASH_SPI_CLK                      RCC_APB2Periph_SPI1
#define sFLASH_SPI_CLK_INIT                 RCC_APB2PeriphClockCmd

#define sFLASH_SPI_SCK_PIN                  GPIO_Pin_5
#define sFLASH_SPI_SCK_PORT             		GPIOA
#define sFLASH_SPI_SCK_CLK              		RCC_APB2Periph_GPIOA
#define sFLASH_SPI_SCK_SOURCE               GPIO_PinSource5
#define sFLASH_SPI_SCK_AF                   GPIO_AF_SPI1

#define sFLASH_SPI_MISO_PIN                 GPIO_Pin_6
#define sFLASH_SPI_MISO_PORT            		GPIOA
#define sFLASH_SPI_MISO_CLK             		RCC_APB2Periph_GPIOA
#define sFLASH_SPI_MISO_SOURCE              GPIO_PinSource6
#define sFLASH_SPI_MISO_AF                  GPIO_AF_SPI1

#define sFLASH_SPI_MOSI_PIN                 GPIO_Pin_7
#define sFLASH_SPI_MOSI_PORT            		GPIOA
#define sFLASH_SPI_MOSI_CLK             		RCC_APB2Periph_GPIOA
#define sFLASH_SPI_MOSI_SOURCE              GPIO_PinSource7
#define sFLASH_SPI_MOSI_AF                  GPIO_AF_SPI1

#define sFLASH_CS_PIN                       GPIO_Pin_4
#define sFLASH_CS_PORT                  		GPIOA
#define sFLASH_CS_CLK                   		RCC_APB2Periph_GPIOA

#define sFLASH_WP_PIN                       GPIO_Pin_15
#define sFLASH_WP_PORT                  		GPIOA
#define sFLASH_WP_CLK                   		RCC_APB2Periph_GPIOA
   
#define SPI_INTERFACE_INIT()                sFLASH_LowLevel_Init()        //SPI读写函数前都需要调用该初始化函数,这是由于和EEPROM工口导致.
   
/* Exported macro ------------------------------------------------------------*/
/* Select sFLASH: Chip Select pin low */
#define sFLASH_CS_LOW()       GPIO_ResetBits(sFLASH_CS_PORT, sFLASH_CS_PIN);spi_Delay_uS(20)
/* Deselect sFLASH: Chip Select pin high */
#define sFLASH_CS_HIGH()      GPIO_SetBits(sFLASH_CS_PORT, sFLASH_CS_PIN);spi_Delay_uS(20)  
/* Select sFLASH: Chip Protect pin low */
#define sFLASH_WP_LOW()       GPIO_ResetBits(sFLASH_WP_PORT, sFLASH_WP_PIN);spi_Delay_uS(20)
/* Deselect sFLASH: Chip Protect pin high */
#define sFLASH_WP_HIGH()      GPIO_SetBits(sFLASH_WP_PORT, sFLASH_WP_PIN);spi_Delay_uS(20)  

/* Exported functions ------------------------------------------------------- */

/* High layer functions  */
void sFLASH_LowLevel_Init(void);    
void spi_Delay_uS(u32 x);
void SPI_FLASH_AllUnprotect(void);
void sFLASH_DeInit(void);
void sFLASH_Init(void);
void sFLASH_EraseSector(uint32_t SectorAddr);
void sFLASH_EraseBulk(void);
void sFLASH_WritePage(uint8_t* pBuffer, uint32_t WriteAddr, uint16_t NumByteToWrite);
void sFLASH_WriteBuffer(uint8_t* pBuffer, uint32_t WriteAddr, uint16_t NumByteToWrite);
void sFLASH_ReadBuffer(uint8_t* pBuffer, uint32_t ReadAddr, uint16_t NumByteToRead);
uint32_t sFLASH_ReadID(void);
void sFLASH_StartReadSequence(uint32_t ReadAddr);

/* Low layer functions */
uint8_t sFLASH_ReadByte(void);
uint8_t sFLASH_SendByte(uint8_t byte);
uint16_t sFLASH_SendHalfWord(uint16_t HalfWord);
void sFLASH_WriteEnable(void);
void sFLASH_WaitForWriteEnd(void);
ErrorStatus sFLASH_CheckChip(void);
#ifdef __cplusplus
}
#endif

#endif /* __SPI_FLASH_H */


/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
